[{"author": "Madonna Virola", "title": "DTI office in Oriental Mindoro on temporary lockdown", "publishedAt": "2021-03-11", "content": "CITY OF CALAPAN The Department of Trade and Industry (DTI) provincial office in Oriental Mindoro based in this city has been placed on temporary lockdown starting on Wednesday, March 10, until March … [+1717 chars]"}, {"author": "Delfin T. Mallari Jr.", "title": "Quezon taps peoples’ groups in COVID-19 vaccination drive", "publishedAt": "2021-03-11", "content": "LUCENA CITY The provincial government of Quezon has tapped the help of peoples organizations to address the widespread public skepticism on the coronavirus disease (COVID-19) vaccination program.\r\nJa… [+3252 chars]"}, {"author": "Agence France-Presse", "title": "WHO says no reason to stop using AstraZeneca jab", "publishedAt": "2021-03-12", "content": "GENEVA The World Health Organization (WHO) said Friday there was no reason to stop using AstraZeneca’s COVID-19 vaccine after several countries suspended the rollout over blood clot fears.\r\nThe WHO, … [+4040 chars]"}, {"author": "clopez", "title": "Irked Thai PM ‘sanitizes’ journalists", "publishedAt": "2021-03-11", "content": "VEXED Thai Prime Minister Prayuth Chan-ocha sprays hand sanitizer at front row journalists to avert answering questions on the latest Cabinet reshuffle in Bangkok, Thailand, on Tuesday. REUTERS\r\nBANG… [+1702 chars]"}, {"author": "Cristina Eloisa Baclig", "title": "DATA: A year of COVID-19 quarantine in PH", "publishedAt": "2021-03-12", "content": "Checkpoint signage is seen as a soldier (R) checks the temperature of a motorist before entering Manila on March 16, 2020, as part of measures to reduce the spread of the COVID-19 pandemic. – The vir… [+12346 chars]"}, {"author": "kadraneda", "title": "What you need to know about the Johnson & Johnson vaccine", "publishedAt": "2021-03-11", "content": "(FILES) In this file photo taken on March 5, 2021, registered nurse Florisa N. Lingad holds a Johnson &amp; Johnson Covid-19 vaccine at a vaccination center established at the Hilton Chicago O’Hare A… [+5244 chars]"}, {"author": "dmorcoso", "title": "Myanmar junta accuses Suu Kyi of taking bribes as eight killed in anti-coup protests", "publishedAt": "2021-03-11", "content": null}, {"author": "lboniol", "title": "Boy, prisoner, 2 elderlies contract COVID-19 in San Pablo City", "publishedAt": "2021-03-11", "content": "LUCENA CITY - A year-old boy, a jail inmate, and two elderlies were among the 12 new coronavirus disease (COVID-19) patients recorded in San Pablo City in Laguna province on Wednesday, local authorit… [+1505 chars]"}, {"author": "dmorcoso", "title": "Olongapo logs 6 new COVID-19 cases", "publishedAt": "2021-03-11", "content": "OLONGAPO CITY Six new cases of the coronavirus disease (COVID-19) were recorded in this city on Wednesday, raising its total number of patients to 1,076 since last year.\r\nIn a statement, Mayor Rolen … [+1100 chars]"}, {"author": "kadraneda", "title": "Pandemic crippling nature conservation efforts", "publishedAt": "2021-03-11", "content": "This photo taken on November 20, 2014, shows an aerial view of the Great Barrier Reef off the coast of the Whitsunday Islands, along the central coast of Queensland. The Great Barrier Reef Marine Par… [+5405 chars]"}, {"author": "postie", "title": "Duterte bent on reopening economy soon even as COVID-19 cases in PH continue to rise", "publishedAt": "2021-03-11", "content": "MANILA, Philippines Despite the persistently increasing number of COVID-19 infections in the country, President Rodrigo Duterte on Thursday said that he has to reopen the economy in “a timetable of j… [+3349 chars]"}, {"author": "dmorcoso", "title": "Tagaytay has 35 new COVID-19 cases; 25 contract virus in wake", "publishedAt": "2021-03-12", "content": "LUCENA CITY Thirty-five new coronavirus disease (COVID-19) cases were recorded in Tagaytay City in Cavite province, 25 of whom contracted the virus in a wake for the dead, local authorities reported … [+1684 chars]"}, {"author": "clopez", "title": "Sinas tests positive for coronavirus", "publishedAt": "2021-03-11", "content": "Gen. Debold Sinas, the chief of the Philippine National Police, has tested positive for the coronavirus.\r\nBut Brig. Gen. Ildebrandi Usana, speaking for the PNP on Thursday, said there was nothing to … [+1412 chars]"}, {"author": "kadraneda", "title": "Texas Attorney General sues Austin officials over not lifting mask mandate", "publishedAt": "2021-03-12", "content": "FILE PHOTO: A sign promotes mask-wearing at a bar as the state of Texas prepares to lift its mask mandate and reopen businesses to full capacity during the coronavirus disease (COVID-19) pandemic in … [+2215 chars]"}, {"author": "postie", "title": "San Juan logs 133 new active COVID-19 cases in 10 days", "publishedAt": "2021-03-11", "content": "The implementation of the curfew is basically a psychological  reminder to people that Hey, guys, were experiencing a spike, please change your mindset, do not relax, do not be confident just because… [+769 chars]"}, {"author": "dmorcoso", "title": "Passengers  bound for Iloilo City need to submit negative swab test result", "publishedAt": "2021-03-11", "content": "BACOLOD CITY All passengers arriving in Iloilo City, except those from neighboring Western Visayas areas, will be required to submit a negative swab test result issued not more than 72 hours before t… [+1573 chars]"}, {"author": "postie", "title": "Duterte to police, military: Go after people faking COVID-19 test results", "publishedAt": "2021-03-11", "content": null}, {"author": "kadraneda", "title": "Biden says Americans will be first to get vaccines; any surplus to be shared", "publishedAt": "2021-03-11", "content": "U.S. President Joe Biden announces administration plans to double its order of the single-shot Johnson &amp; Johnson coronavirus vaccine, procuring an additional 100 million doses, during an event wi… [+2814 chars]"}, {"author": "kadraneda", "title": "Vaccine hope, but enduring fear one year after pandemic declared", "publishedAt": "2021-03-11", "content": "This photograph taken on January 4, 2021, in Paris, shows figurines next to a vaccine vial reading “COVID-19 vaccine”. (Photo by JOEL SAGET / AFP)\r\nBrasília, Brazil The world on Thursday marked one y… [+5549 chars]"}, {"author": "postie", "title": "Philippines to get 30 million doses of Novavax jab by Q2-Q3, says envoy", "publishedAt": "2021-03-11", "content": "MANILA, Philippines The Philippines might receive 30 million doses of the COVID-19 vaccine developed by American firm Novavax, which is being manufactured in India, in the late second quarter or earl… [+2413 chars]"}]